/*程序设计基础论文




 




  计算机与信息工程学院
网络编程
刘昊忻
20151104714



摘要： 21世纪是一个日新月异的世纪，作为新型产品的计算机更是一光的速度发展着，本论文主要讲诉了作者在计算机基础课程学习的过程中对计算机的理解和认识。 
关键字：计算机系统，指针，Arduino。
1.	对计算机系统的认识
 计算机是新世纪的产物，从诞生到现在，计算机经历了无数次的更新换代，1946年，世界上第一台计算机在美国宾夕尼亚大学问世了，表明了电子计算机时代的到来，之后的发展更是日新月异，以惊人的速度发展，没有任何一门技术的性能价格比能在30年内增长6个数量级。
  计算机的发展经历了电子管数字机，晶体管数字机，集成电路数字机，大规模集成电路机四个时代，到了现在，电脑更是进入了千家万户，成为了人们日常生活，娱乐办公不可或缺的一部分。
  软件系统和硬件系统是计算机的俩个组成部分，其中硬件系统一般包括电源，主板，中央处理器，内存，硬盘，声卡，显卡，网卡，调整解调器，光驱，显示器，键盘，鼠标，音响。有的还包括打印机和一些视频设备，如摄像头、扫描仪、数码相机、数码摄像机、电视卡等设备，用于处理视频信号。而软件系统指的是为了使用方便和提高效率开发的相关程序，分为系统软件和应用软件两大类。系统软件是计算机与用户的接口，它的主要目的是方便用户控制和使用计算机。系统软件主要分为操作系统和语言处理系统，其中操作系统是系统软件的核心，是直接运行在计算机硬件上的，最基本的系统软件，它是由一系列具有不同控制和管理功能的程序组成，主要负责管理，控制和监督计算机软，硬件资源协调运行的程序。操作系统一般包括处理器管理，作业管理，存储器管理，设备管理和文件管理五大功能，操作系统随着计算机硬件技术的发展而发展，从简单到复杂，种类繁多。
2.	对指针的认识
3.	对Arduino的认识 

*/


















